{"algorithms": {
    "version": 110505,
    "algorithm": [
        {
            "name": "SectLabel",
            "variant": {
                "no": 0,
                "note": {
                    "confidence": 0.771415,
                    "content": "Proceedings of the 2012 Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural\nLanguage Learning, pages 1357–1367, Jeju Island, Korea, 12–14 July 2012. c?2012 Association for Computational Linguistics"
                },
                "figure": [
                    {
                        "confidence": 0.986760066666667,
                        "content": "??\n$$\n?\n5k $ \u0092\u0094\n4k $$$\n\u0088\u008b\n3k\n\u0088\u0091\n2k\n?\n1k\n$$ $$\n0\n$ $\nprice range"
                    },
                    {
                        "confidence": 0.493862428571429,
                        "content": "price range\nprice range \u0083\u0096\u0096\u0094?\u0085\u008e\u0083\u0095\u0095?? ?\u0085\u008a\u0083\u0094\u0096??\nthree parts (80% for training, 10% for development,\n?\u0083\u0096\u0094?\u0099\u0086\u0096\u008a? ??\n\u0083\u0096\u0096?\u008a\u008b\u008a? \u008a???\n10% for evaluation), independently for each city.\n\u0098\u0083\u0094 \u009b ? \u0086?\u0095\u0085\u008e\u0087\u008b\u0090\u0087\u0083\u0094??"
                    },
                    {
                        "confidence": 0.958462,
                        "content": "?\u0083\u0096\u0096\u0094??\u009b?? \u008a????\u0083\u0096\u0096\u0094??\u009b\n500k\n400k\n300k\n200k\n100k\n0\nstar rating"
                    },
                    {
                        "confidence": 0.918727,
                        "content": "+— cheap expensive ?\nT\n®\ne\nl"
                    },
                    {
                        "confidence": 0.416359,
                        "content": "s\nthis place gets 5 stars for food , drinks , and atmosphere ... and negative stars for the jar-headed douche bag `` security guards ''\nand an negativ star fo th jarheaded douche g guards"
                    },
                    {
                        "confidence": 0.508026333333333,
                        "content": "g\ngreat dark , sexy atmosphere . good service . nice variety of tasty cocktails . sushi tasted good , food was fresh but nothing left me yearning to return\nvariety o s cocktail tasted e bt yearning to retu"
                    },
                    {
                        "confidence": 0.993476666666667,
                        "content": "positive\ncheap expensive\nnegative"
                    }
                ],
                "address": {
                    "confidence": 0.706844,
                    "content": "Andover, MA 01810, USA"
                },
                "author": [
                    {
                        "confidence": 0.993521,
                        "content": "Victor Chahuneau Kevin Gimpel"
                    },
                    {
                        "confidence": 0.933386,
                        "content": "Bryan R. Routledge"
                    },
                    {
                        "confidence": 0.725815,
                        "content": "Lily Scherlis"
                    },
                    {
                        "confidence": 0.993386,
                        "content": "Noah A. Smith"
                    }
                ],
                "confidence": 0,
                "equation": [
                    {
                        "confidence": 0.8550795,
                        "content": "\u0090\u0083\u008f\u008b\u008e\u009b\n? ? ?? ?\nthe word chicken. What is the price of chicken? This\n?\u0097\u0096?????"
                    },
                    {
                        "confidence": 0.82057,
                        "content": "?\u0097\u0096?????\n?\u0097\u0096???"
                    },
                    {
                        "confidence": 0.97668375,
                        "content": "k 3k ?\u0090 ????? ???\u008e\u0091\u0096?\nranges (left) and review ratings (right).\n\u0098\u0083\u0094 \u0086\u0083\u0096\u0083 ?\n2k 2k ?"
                    },
                    {
                        "confidence": 0.84478,
                        "content": "\u0098\u0083\u0094 ? ? \u008e\u0099 ? ?\u0084\u0099?\u008f\u0099? ? \u0086\u0083\u0096\u0083\n1k 1k \u0086?\nare shown in Figure 1."
                    },
                    {
                        "confidence": 0.635567,
                        "content": "?\u0083\u0096\u0096\u0094?\u009b \u0088\u0097\u0090\u0096\u008b\u0091\u0090?\u0086 \u008b?\n?\u0083\u0096\u008a\u0089"
                    },
                    {
                        "confidence": 0.787115266666667,
                        "content": "\u0096\u0087\u009a\u0096?\u0088\u0097\u0090\u0085\u0096\u008b\u0091\u0090?\u0086? ? \u0094\u0087\u0096\u0097\u0094\u0090\nsparsity is desirable. We tune the regularization co-\n\u008a\u0083\u0094\u0096?\u0087\u008e\u0087\u0085\u0096?\u008e\u008e??\u0092\u0094?\n\u0086\u0096?\u0086?\nefficient by choosing the value that minimizes de-\n\u0087\u0090\u0096\u0087\u0094?\u0083\u0092\u0092\u0087\u0090\u0086??\u0096\u0087\u009a\u0096??\nvelopment set loss (mean squared error and log loss,\n?\u0083\u0096\u0096\u0094?\u0085\u008e\u0083\u0095\u0095? \u0092\u0094?\n\u0096 ?\u0086\nrespectively).\nFor evaluation, we use mean absolute error\n?\u0095\u0096\u008e\u0087??\u0096\u0087\u0096?\u0083\u0090\u0085\u008a\u0091\u0094 ?\u008f\u008b\u0086\n(MAE) and mean relative error (MRE). Given a\n?\u0096\u009a\u0096?\u0088\u0097\u0085\u0096\u008b\u0091\u0090?\u0086 \u008b? ? \u0087\u0096\n\u0086?\u008b\u0087"
                    },
                    {
                        "confidence": 0.9985084,
                        "content": "1\nMAE =\nN\n1\nMRE = N"
                    },
                    {
                        "confidence": 0.996214555555556,
                        "content": "N\ni=1\n|yi ? yi|\ni\nyi ? 9i\nyi\ni\nN\ni=1"
                    },
                    {
                        "confidence": 0.9884755,
                        "content": "wg = (wT® + wTe) ? (wl® + wle)\nw* = (wT® + wl®) ? (wTe + wle)"
                    }
                ],
                "subsectionHeader": [
                    {
                        "confidence": 0.4154405,
                        "content": "?\u0083\u0096\u0096\u0094?? \u0099????\n?\u0094? \u0097\u0090\u0085\u0090\u0086 \u008b?"
                    },
                    {
                        "confidence": 0.715074,
                        "content": "5.1 Features"
                    },
                    {
                        "confidence": 0.831859,
                        "content": "5.2 Results"
                    },
                    {
                        "confidence": 0.996931,
                        "content": "5.3 Analysis"
                    },
                    {
                        "confidence": 0.877748,
                        "content": "6.1 Results"
                    },
                    {
                        "confidence": 0.999502,
                        "content": "6.2 Interpreting Reviews"
                    },
                    {
                        "confidence": 0.9906,
                        "content": "7.1 Analysis"
                    }
                ],
                "footnote": [
                    {
                        "confidence": 0.99569,
                        "content": "1The price distribution is more symmetric in the log domain.\n2This list can be found in the supplementary material."
                    },
                    {
                        "confidence": 0.95312,
                        "content": "3The normalized item names are present as binary features\nin all of our regression models"
                    },
                    {
                        "confidence": 0.992237,
                        "content": "4This list is included in the supplementary material."
                    }
                ],
                "title": {
                    "confidence": 0.554835,
                    "content": "Word Salad: Relating Food Prices and Descriptions"
                },
                "reference": [
                    {
                        "confidence": 0.999665551724138,
                        "content": "N. Archak, A. Ghose, and P. G. Ipeirotis. 2011. Deriv-\ning the pricing power of product features by mining\nconsumer reviews. Management Science, 57(8).\nM. R. Baye, J. Morgan, and P. Scholten. 2006. Eco-\nnomics and information systems; handbooks in infor-\nmation systems. In T. Hendershott, editor, Judgement\nunder Uncertainty: Heuristics and Biases. Elsevier,\nAmsterdam.\nJ. Eisenstein, B. O’Connor, N. A. Smith, and E. P. Xing.\n2010. A latent variable model for geographic lexical\nvariation. In Proc. of EMNLP.\nJ. Eisenstein, N. A. Smith, and E. P. Xing. 2011. Discov-\nering sociolinguistic associations with structured spar-\nsity. In Proc. of ACL.\nG. Ellison. 2005. A model of add-on pricing. Quarterly\nJournal of Economics, 120(2):585–637, May.\nJ. Freedman and D. Jurafsky. 2011. Authenticity in\nAmerica: Class distinctions in potato chip advertising.\nGastronomica, 11(4):46–54.\nA. Ghose and P. G. Ipeirotis. 2011. Estimating the help-\nfulness and economic impact of product reviews: Min-\ning text and reviewer characteristics. IEEE Transac-\ntions on Knowledge and Data Engineering, 23(10).\nA. Ghose, P. G. Ipeirotis, and A. Sundararajan. 2007.\nOpinion mining using econometrics: A case study on\nreputation systems. In Proc. of ACL.\nM. Hu and B. Liu. 2004. Mining opinion features in\ncustomer reviews. In Proc. of AAAI.\nM. Joshi, D. Das, K. Gimpel, and N. A. Smith. 2010.\nMovie reviews and revenues: An experiment in text\nregression. In Proc. of NAACL.\nM. L. Kasavana and D. I. Smith. 1982. Menu Engineer-\ning: A Practical Guide to Menu Analysis. Hospitality\nPublications.\nT. J. Kelly, N. M. Kiefer, and K. Burdett. 1994. A\ndemand-based approach to menu pricing. Cornell Ho-\ntel and Restaurant Administrative Quarterly, 35(1).\nS. Kogan, D. Levin, B. R. Routledge, J. Sagi, and N. A.\nSmith. 2009. Predicting risk from financial reports\nwith regression. In Proc. of NAACL.\nM. Koppel and I. Shtrimberg. 2006. Good news or bad\nnews? let the market decide. Computing Attitude and\nAffect in Text: Theory and Applications.\nK. Lerman, A. Gilder, M. Dredze, and F. Pereira. 2008.\nReading the markets: Forecasting public opinion of\npolitical candidates by news analysis. In Proc. of\nCOLING.\nP. McCullagh. 1980. Regression models for ordinal\ndata. Journal of the royal statistical society. Series B\n(Methodological), pages 109–142.\nP. J. McVety, B. J. Ware, and C. L. Ware. 2008. Funda-\nmentals of Menu Planning. John Wiley & Sons.\nJ. E. Miller and D. V. Pavesic. 1996. Menu: Pricing &\nStrategy. Hospitality, Travel, and Tourism Series. John\nWiley & Sons.\nB. Pang and L. Lee. 2008. Opinion mining and senti-\nment analysis. Foundations and Trends in Information\nRetrieval, 2(1-2):1–135."
                    },
                    {
                        "confidence": 0.988610230769231,
                        "content": "B. Wansink, J. E. Painter, and K. van Ittersum. 2001.\nDescriptive menu labels’ effect on sales. Cornell Ho-\ntel and Restaurant Administrative Quarterly, 42(6).\nB. Wansink, K. van Ittersum, and J. E. Painter. 2005.\nHow descriptive food names bias sensory perceptions\nin restaurants. Food Quality and Preference, 16(5).\nD. Yogatama, M. Heilman, B. O’Connor, C. Dyer, B. R.\nRoutledge, and N. A. Smith. 2011. Predicting a sci-\nentific community’s response to an article. In Proc. of\nEMNLP.\nA. D. Zwicky and A. M. Zwicky. 1980. America’s na-\ntional dish: The style of restaurant menus. American\nSpeech, 55(2):83–92."
                    }
                ],
                "bodyText": [
                    {
                        "confidence": 0.999760666666667,
                        "content": "We investigate the use of language in food\nwriting, specifically on restaurant menus and\nin customer reviews. Our approach is to build\npredictive models of concrete external vari-\nables, such as restaurant menu prices. We\nmake use of a dataset of menus and customer\nreviews for thousands of restaurants in several\nU.S. cities. By focusing on prediction tasks\nand doing our analysis at scale, our method-\nology allows quantitative, objective measure-\nments of the words and phrases used to de-\nscribe food in restaurants. We also explore\ninteractions in language use between menu\nprices and sentiment as expressed in user re-\nviews."
                    },
                    {
                        "confidence": 0.99690265,
                        "content": "What words might a menu writer use to justify the\nhigh price of a steak? How does describing an item\nas chargrilled vs. charbroiled affect its price? When\na customer writes an unfavorable review of a restau-\nrant, how is her word choice affected by the restau-\nrant’s prices? In this paper, we explore questions\nlike these that relate restaurant menus, prices, and\ncustomer sentiment. Our goal is to understand how\nlanguage is used in the food domain, and we di-\nrect our investigation using external variables such\nas restaurant menu prices.\nWe build on a thread of NLP research that seeks\nlinguistic understanding by predicting real-world\nquantities from text data. Recent examples include\nprediction of stock volatility (Kogan et al., 2009)\nand movie revenues (Joshi et al., 2010). There, pre-\ndiction tasks were used for quantitative evaluation\nand objective model comparison, while analysis of\nlearned models gave insight about the social process\nbehind the data.\nWe echo this pattern here as we turn our atten-\ntion to language use on restaurant menus and in user\nrestaurant reviews. We use data from a large cor-\npus of restaurant menus and reviews crawled from\nthe web and formulate several prediction tasks. In\naddition to predicting menu prices, we also consider\npredicting sentiment along with price.\nThe relationship between language and senti-\nment is an active area of investigation (Pang and\nLee, 2008). Much of this research has focused on\ncustomer-written reviews of goods and services, and\nperspectives have been gained on how sentiment is\nexpressed in this type of informal text. In addition\nto sentiment, however, other variables are reflected\nin a reviewer’s choice of words, such as the price of\nthe item under consideration. In this paper, we take\na step toward joint modeling of multiple variables\nin review text, exploring connections between price\nand sentiment in restaurant reviews.\nHence this paper contributes an exploratory data"
                    },
                    {
                        "confidence": 0.99927875,
                        "content": "analysis of language used to describe food (by its\npurveyors and by its consumers). While our primary\ngoal is to understand the language used in our cor-\npus, our findings bear relevance to economics and\nhospitality research as well. This paper is a step on\nthe way to the eventual goal of using linguistic anal-\nysis to understand social phenomena like sales and\nconsumption."
                    },
                    {
                        "confidence": 0.999978011764706,
                        "content": "There are several areas of related work scattered\nthroughout linguistics, NLP, hospitality research,\nand economics.\nFreedman and Jurafsky (2011) studied the use of\nlanguage in food advertising, specifically the words\non potato chip bags. They argued that, due to\nthe ubiquity of food writing across cultures, eth-\nnic groups, and social classes, studying the use of\nlanguage for describing food can provide perspec-\ntive on how different socioeconomic groups self-\nidentify using language and how they are linguisti-\ncally targeted. In particular, they showed that price\naffects how “authenticity” is realized in marketing\nlanguage, a point we return to in §5. This is an ex-\nample of how price can affect how an underlying\nvariable is expressed in language. Among other ex-\nplorations in this paper, we consider how price inter-\nacts with expression of sentiment in user reviews of\nrestaurants.\nAs mentioned above, our work is related to re-\nsearch in predicting real-world quantities using text\ndata (Koppel and Shtrimberg, 2006; Ghose et al.,\n2007; Lerman et al., 2008; Kogan et al., 2009; Joshi\net al., 2010; Eisenstein et al., 2010; Eisenstein et\nal., 2011; Yogatama et al., 2011). Like much of\nthis prior work, we aim to learn how language is\nused in a specific context while building models that\nachieve competitive performance on a quantitative\nprediction task.\nAlong these lines, there is recent interest in ex-\nploring the relationship between product sales and\nuser-generated text, particularly online product re-\nviews. For example, Ghose and Ipeirotis (2011)\nstudied the sales impact of particular properties of\nreview text, such as readability, the presence of\nspelling errors, and the balance between subjective\nand objective statements. Archak et al. (2011) had a\nsimilar goal but decomposed user reviews into parts\ndescribing particular aspects of the product being\nreviewed (Hu and Liu, 2004). Our paper differs\nfrom price modeling based on product reviews in\nseveral ways. We consider a large set of weakly-\nrelated products instead of a homogeneous selection\nof a few products, and the reviews in our dataset are\nnot product-centered but rather describe the overall\nexperience of visiting a restaurant. Consequently,\nmenu items are not always mentioned in reviews and\nrarely appear with their exact names. This makes it\ndifficult to directly use review features in a pricing\nmodel for individual menu items.\nMenu planning and pricing has been studied for\nmany years by the culinary and hospitality research\ncommunity (Kasavana and Smith, 1982; Kelly et al.,\n1994), often including recommendations for writing\nmenu item descriptions (Miller and Pavesic, 1996;\nMcVety et al., 2008). Their guidelines frequently\ninclude example menus from successful restaurants,\nbut typically do not use large corpora of menus or\nautomated analysis, as we do here. Other work\nfocused more specifically on particular aspects of\nthe language used on menus, such as the study by\nZwicky and Zwicky (1980), who made linguistic ob-\nservations through manual analysis of a corpus of\n200 menus.\nRelatedly, Wansink et al. (2001; 2005) showed\nthat the way that menu items are described af-\nfects customers’ perceptions and purchasing behav-\nior. When menu items are described evocatively,\ncustomers choose them more often and report higher\nsatisfaction with quality and value, as compared to\nwhen they are given the same items described with\nconventional names. Wansink et al. did not use a\ncorpus, but rather conducted a small-scale experi-\nment in a working cafeteria with customers and col-\nlected surveys to analyze consumer reaction. While\nour goals are related, our experimental approach is\ndifferent, as we use automated analysis of thousands\nof restaurant menus and rely on a set of one mil-\nlion reviews as a surrogate for observing customer\nbehavior.\nFinally, the connection between products and\nprices is also a central issue in economics. How-\never, the stunning heterogeneity in products makes\nempirical work challenging. For example, there are\nover 50,000 menu items in New York that include"
                    },
                    {
                        "confidence": 0.999632,
                        "content": "is an important practical and daunting matter when\nmeasuring inflation (e.g., Consumer Price Index is\nmeasured with a precisely-defined basket of goods).\nPrice dispersion across goods and the variation of\nthe goods is an important area of industrial organi-\nzation economic theory. For example, economists"
                    },
                    {
                        "confidence": 0.9829875,
                        "content": "are interested in models of search, add-on pricing,\nand obfuscation (Baye et al., 2006; Ellison, 2005)."
                    },
                    {
                        "confidence": 0.99316776,
                        "content": "We crawled Allmenus.com (www.allmenus.\ncom) to gather menus for restaurants in seven\nU.S. cities: Boston, Chicago, Los Angeles, New\nYork, Philadelphia, San Francisco, and Washing-\n???\nton, D.C. Each menu includes a list of item names\nwith optional text descriptions and prices. Most All-\nmenus restaurant pages contain a link to the cor-\nresponding page on Yelp (www.yelp.com) with\nmetadata and user reviews for the restaurant, which\nwe also collected.\nThe metadata consist of many fields for each\nrestaurant, which can be divided into three cate-\ngories: location (city, neighborhood, transit stop),\nservices available (take-out, delivery, wifi, parking,\netc.), and ambience (good for groups, noise level,\nattire, etc.). Also, the category of food and a price\nrange ($ to $$$$, indicating the price of a typical\nmeal at the restaurant) are indicated. The user re-\nviews include a star rating on a scale of 1 to 5.\nThe distribution of prices of individual menu\nitems is highly skewed, with a mean of $9.22 but\na median of $6.95. On average, a restaurant has\n73 items on its menu with a median price of $8.69\nand 119 Yelp reviews with a median rating of 3.55"
                    },
                    {
                        "confidence": 0.908594,
                        "content": "stars. The star rating and price range distributions"
                    },
                    {
                        "confidence": 0.967385,
                        "content": "The set ofrestaurants was randomly split into"
                    },
                    {
                        "confidence": 0.8231826,
                        "content": "The sizes of the splits and the full set of dataset\n?\u0086\u0091\u008f\u0083\u008b\u0090???? \u0086??\u008f\u0083\u009a\u0086\u0083\u0096\u0083???\n?\u0094\u0083\u0090\u0089\u0087\nstatistics are provided in Table 1.\n\u0083\u0094\u0096\u0095\u0087\u008e"
                    },
                    {
                        "confidence": 0.99737,
                        "content": "We consider several prediction tasks using the"
                    },
                    {
                        "confidence": 0.8341307,
                        "content": "dataset just described. These include predicting\n\u0083\u0096\u0096\u0094?\u0099\u008b\u0086\u0096\u008a? \u0084\u0099??\nindividual menu item prices (§5), predicting the\n\u008a\u0083\u0094\u0096?\u0095\u0087\u008e\u0087\u0085\u0096?\u008e\u008e???\u0094\u0097\u008e\u0087??\nprice range for each restaurant (§6), and finally\n?\u0086\u0083\u0096\u0083?\u009b?\u008b\u0085\u008d\u0095??\n\u0096??\u0083\u0092\u0087\u0090??\u0096\u0096??\njointly predicting median price and sentiment for\n\u0083\u0096\u0096\u0094??\u0085\u008e\u0083\u0095?? ?\u0094\u0097\u008e\u0087??\neach restaurant (§7). To do this, we use two types"
                    },
                    {
                        "confidence": 0.722723,
                        "content": "of models: linear regression (§5 and §6) and logis-\n\u0083\u0096\u0096\u0094??\u0096\u0087\u009a\u0096\u0083\u0090\u0085\u0091\u0094? ?\u0087\u0090\u0086?\ntic regression (§7), both with ?1 regularization when"
                    },
                    {
                        "confidence": 0.92583,
                        "content": "dataset (xi7 yi)Ni_1 with inputs xi and outputs yi, and"
                    },
                    {
                        "confidence": 0.9966625,
                        "content": "denoting predicted outputs by yi, these are defined\nas follows:"
                    },
                    {
                        "confidence": 0.956997111111111,
                        "content": "In practice, since we model log-prices but eval-\nuate on real prices, the final prediction is often a\nnon-linear transformation of the output of the linear\nclassifier of weight vector w, which we denote by:\nyi = f(w'xi).\nWe also frequently report the total number of fea-\ntures available in the training set for each model (nf)\nas well as the number of non-zero feature weights\nfollowing learning (nnz)."
                    },
                    {
                        "confidence": 0.99868848,
                        "content": "We first consider the problem of predicting the price\nof each item on a menu. In this case, every in-\nstance xi corresponds to a single item in the menu\nparametrized by the features detailed below and yi is\nthe item’s price. In this section, our models always\nuse the logarithm of the price1 as output values and\ntherefore: Pi = e&quot;&quot;'Txz.\nBaselines We evaluate several baselines which\nmake independent predictions for each distinct item\nname. The first two predict the mean or the me-\ndian of the prices in the training set for a given\nitem name, and use the overall price mean or me-\ndian when a name is missing in the training set. The\nthird baseline is an `1-regularized linear regression\nmodel trained with a single binary feature for each\nitem name in the training data. These baselines are\nshown as the first three rows in Table 2.\nWe note that there is a wide variation of menu\nitem names in the dataset, with more than 400,000\ndistinct names. Although we address this issue later\nby introducing local text features, we also performed\nsimple normalization of the item names for all of\nthe baselines described above. To do this normal-\nization, we first compiled a stop word list based on\nthe most frequent words in the item names.2 We"
                    },
                    {
                        "confidence": 0.9996092,
                        "content": "removed stop words and then ordered the words in\neach item name lexicographically, in order to col-\nlapse together items such as coffee black and black\ncoffee. This normalization reduced the unique item\nname count by 40%, strengthening the baselines."
                    },
                    {
                        "confidence": 0.955420054054054,
                        "content": "We use `1-regularized linear regression for feature-\nrich models. We now introduce several sets of fea-\ntures that we add to the normalized item names:3\nI. METADATA: Binary features for each restaurant\nmetadata field mentioned above, excluding price\nrange. A separate binary feature is included for\neach unique (field, value) tuple.\nII. MENUNAMES: n-grams in menu item names.\nWe used binary features for unique unigrams, bi-\ngrams, and trigrams. Here, stop words were re-\ntained as they can be informative (e.g., with and\nlarge correlate with price).\nIII. MENUDESC: n-grams in menu item descrip-\ntions, as in MENUNAMES.\nReview Features In addition to these features, we\nconsider leveraging the large amount of text present\nin user reviews to improve predictions. We at-\ntempted to find mentions of menu items in the re-\nviews and to include features extracted from the sur-\nrounding words in the model. Perfect item mentions\nbeing relatively rare, we consider inexact matches\nweighted by a coefficient measuring the degree of\nresemblance: we used the Dice similarity between\nthe set of words in the sentence and in the item name.\nWe then extracted n-gram features from this sen-\ntence, and tried several ways to use them for price\nprediction.\nGiven a review sentence, one option is to add the\ncorresponding features to every item matching this\nsentence, with a value equal to the similarity coeffi-\ncient. Another option is to select the best matching\nitem and use the same real-valued features but only\nfor this single item. Binary feature values can be\nused instead of the real-valued similarity coefficient.\nWe also experimented with the use of part-of-speech\ntags in order to restrict our features to adjective and\nadverb n-grams instead of the full vocabulary. All of"
                    },
                    {
                        "confidence": 0.999902352941177,
                        "content": "these attempts yielded negative or only slightly pos-\nitive results, of which we include only one example\nin our experiments: the MENTIONS feature set con-\nsists of n-grams for the best matching item with the\nDice coefficient as the feature value.\nWe also tried to incorporate the reviews by using\nthem in aggregate via predictions from a separate\nmodel; we found this approach to work better than\nthe methods described above which all use features\nfrom the reviews directly in the regression model. In\nparticular, we use the review features in a separate\nmodel that we will describe below (§6) to predict\nthe price range of each restaurant. The model uses\nunigrams, bigrams, and trigrams extracted from the\nreviews. We use the estimated price range (which we\ndenote PR) as a single additional real-valued feature\nfor individual item price prediction."
                    },
                    {
                        "confidence": 0.999960214285714,
                        "content": "Our results are shown in Table 2. We achieve a fi-\nnal reduction of 50 cents in MAE and nearly 10%\nin MRE compared with the baselines. Using menu\nname features (MENUNAMES) brings the bulk of\nthe improvement, though menu description features\n(MENUDESC) and the remaining features also lead\nto small gains. Interestingly, as the MENUDESC and\nPR features are added to the model, the regulariza-\ntion favors more general features by selecting fewer\nand fewer non-zero weights.\nWhile METADATA features improve over the\nbaselines when used alone, they do not lead to im-\nproved performance over the MENU* + PR features,\nsuggesting that the text features may be able to sub-\nstitute for the information in the metadata, at least\nfor prediction of individual item prices.\nThe MENTIONS features resulted in a small im-\nprovement in MAE and MRE, but at the cost of ex-\npanding the model size significantly. A look at the\nlearned feature weights reveals that most of the se-\nlected features seem more coincidental than generic\n(rachel’s, highly negative) when not totally unintu-\nitive (those suicide, highest positive). This suggests\nthat our method of extracting features from men-\ntions is being hampered by noise. We suspect that\nthese features could be more effective with a better\nmethod of linking menu items to mentions in review\ntext."
                    },
                    {
                        "confidence": 0.9995458125,
                        "content": "We also inspected the feature weights of our learned\nmodels. By comparing the weights of related fea-\ntures, we can see the relative differences in terms\nof contribution to menu item prices. Table 3 shows\nexample feature weights, manually arranged into\nseveral categories (taken from the model with ME-\nNUNAMES + MENUDESC + PR + METADATA).\nTable 3(a) shows selected features for the “am-\nbience” field in the Yelp restaurant metadata and\npane (b) lists some unigrams related to cooking\nmethods. Pane (c) shows feature weights for n-\ngrams often used to market menu items; we see\nlarger weights for words targeting those who want to\neat organically- or locally-grown food (farmhouse,\nheirloom, wild, and hormone), compared to those\nlooking for comfort food (old time favorite, tradi-\ntional, real, and fashioned). This is related to ob-\nservations made by Freedman and Jurafsky (2011)\nthat cheaper food is marketed by appealing to tra-\ndition and historicity, with more expensive food de-\nscribed in terms of naturalness, quality of ingredi-\nents, and the preparation process (e.g., handpicked,\nwild caught, etc.). Relatedly, in pane (e) we see\nthat real mashed potatoes are expected to be cheaper\nthan those described as creamy or smooth.\nPane (d) shows feature weights for trigrams con-\ntaining units of chicken; we can see an ordering in\nterms of size (bits < cubes < strips < cuts) as well\nas the price increase associated with the use of the\nword morsels in place of less refined units. We also\nsee a difference between pieces and pcs, with the\nlatter being frequently used to refer to entire cuts of"
                    },
                    {
                        "confidence": 0.9999274375,
                        "content": "chicken (e.g., wings, thighs, etc.) and the former\nmore often used as a synonym for chunks.\nPanes (f), (g), and (h) reveal price differences due\nto slight variations in word form. We find that, even\nthough crispy has a higher weight than crisp, crisp\nbacon is more expensive than crispy bacon. We also\nfind that food items prefixed with roast lead to more\nexpensive prices than the similar roasted, except in\nthe case of pork, though here the different forms may\nbe evoking two different preparation styles.\nAlso of note is the slight difference between\nthe nonstandard mash potato and mashed potato.\nWe observed lower weights with other nonstandard\nspellings, notably portobella having lower weight\nthan each of the more common spellings portabella,\nportobello, and portabello."
                    },
                    {
                        "confidence": 0.999729464285715,
                        "content": "In addition to predicting the prices of individual\nmenu items, we also considered the task of predict-\ning the price range listed for each restaurant on its\nYelp page. The values for this field are integers from\n1 to 4 and indicate the price of a typical meal from\nthe restaurant.\nFor this task, we again train an `1-regularized\nlinear regression model with integral price ranges\nas the true output values yi. Each input xi corre-\nsponds to the feature vector for an entire restaurant.\nFor evaluation, we round the predicted values to the\nnearest integer: yi = ROUND(wTxi) and report the\ncorresponding mean absolute error and accuracy.\nWe compared this simple approach with an or-\ndinal regression model (McCullagh, 1980) trained\nwith the same il regularizer and noted very little im-\nprovement (77.32% vs. 77.15% accuracy for META-\nDATA). Therefore, we only report in this section re-\nsults for the linear regression model.\nIn addition to the feature sets used for individ-\nual menu item price prediction, we used features on\nreviews (REVIEWS). Specifically, we used binary\nfeatures for unigrams, bigrams, and trigrams in the\nfull set of reviews for each restaurant. A stopword\nlist was derived from the training data.4 Bigrams\nand trigrams were filtered if they ended with stop-\nwords. Additionally, features occurring fewer than\nthree times in the training set were discarded."
                    },
                    {
                        "confidence": 0.999997071428571,
                        "content": "Our results for price range prediction are shown\nin Table 4. Predicting the most frequent price\nrange gave us an accuracy of 48.22%. Performance\nimprovements were obtained by separately adding\nmenu (MENU*), metadata (METADATA), and re-\nview features (REVIEWS). Unlike individual item\nprice prediction, the reviews were more helpful than\nthe menu features for predicting overall price range.\nThis is not surprising, since reviewers will often gen-\nerally discuss price in their reviews. We combined\nmetadata and review features to get our best accu-\nracy, exceeding 80%.\nWe also wanted to perform an analysis of senti-\nment in the review text. To do this, we trained a lo-\ngistic regression model predicting polarity for each\nreview; we used the REVIEWS feature set, but this\ntime considering each review as a single training in-\nstance. The polarity of a review was determined by\nwhether or not its star rating was greater than the\naverage rating across all reviews in the dataset (3.7\nstars). We achieved an accuracy of 87% on the test\ndata. We omit full details of these models because\nthe polarity prediction task for user reviews is well-\nknown in the sentiment analysis community and our\nmodel is not an innovation over prior work (Pang\nand Lee, 2008). However, our purpose in training\nthe model was to use the learned weights for under-\nstanding the text in the reviews."
                    },
                    {
                        "confidence": 0.999885341463415,
                        "content": "Given learned models for predicting a restaurant’s\nprice range from its set of reviews as well as polar-\nity for each review, we can turn the process around\nand use the feature weights to analyze the review\ntext. Restricting our attention to reviews of 50–60\nwords, Table 5 shows sample reviews from our test\nset that lead to various predictions of price range and\nsentiment.5\nThis technique can also be useful when trying to\ndetermine the “true” star rating for a review (if pro-\nvided star ratings are noisy), or to show the most\npositive and most negative reviews for a product\nwithin a particular star rating. The 5-point scale\nis merely a coarse approximation to the reviewer’s\nmental state; using fitted models can provide addi-\ntional clues to decode the reviewer’s sentiment.\nWe can also do a more fine-grained analysis of\nreview text by noting the contribution to the price\nrange prediction of each position in the text stream.\nThis is straightforward because our features are sim-\nply n-grams of the review text. In Figure 2, we show\nthe influence of each word in a review sentence on\nthe predicted polarity (brown) and price range (yel-\nlow). The height of a bar at a given position is pro-\nportional to the sum of the feature weights for every\nunigram, bigram, and trigram containing the token\nat that position (there are at most 6 active n-grams\nat a position).\nThe first example shows the smooth shift in ex-\npressed sentiment from the beginning of the sen-\ntence to the end. The second sentence is a difficult\nexample for sentiment analysis, since there are sev-\neral positive words and phrases early but the senti-\nment is chiefly expressed in the final clause. Our\nmodel noted the steady positive sentiment early in\nthe sentence but identified the crucial negation due\nto strong negative weight on bigrams fresh but, left\nme, and me yearning. In both examples, the yellow\nbars show that price estimates are reflected mainly\nthrough isolated mentions of offerings and ameni-\nties (drinks, atmosphere, security, good service)."
                    },
                    {
                        "confidence": 0.948028,
                        "content": "Although we observe no interesting correlation (r =\n0.06) between median star rating and median item\nprice in our dataset, this does not imply that senti-\n5To choose the 9 reviews in the table, we took the reviews\nfrom our test set in the desired length range and computed pre-\ndicted sentiment and price range for each; then we scaled the\npredicted price range so that its range matched that of predicted\nsentiment, and maximized various linear combinations of the\ntwo. This accounts for the four corners. The others were found\nby maximizing a linear combination of one (possibly negated)\nprediction minus the absolute value of the other."
                    },
                    {
                        "confidence": 0.997793105263158,
                        "content": "i love me a cheap vietnamese sandwich . this place is tiny ! the pork buns are so tender amazing service and desserts . nice wine\nmmm , pate. this place has the best ones i and flavorful . i dream about these things . list and urban decor . i went with a girl-\n’ve had in the city , and i conveniently live manila clams were awesome, not the biggest friend and we split an entree, appetizer and\na few blocks away . the ladies behind the clam fan either, but i loved it . mmm 7 spice dessert and they happily brought us separate\ncounter are always courteous and fast, and chips . i ca n’t wait to go back ! portions which were just the right size . the\nwho can beat a $ 3 sandwich ?! crazy ass bread is awesome , too . definitely a bit of a\ndeli . splurge, but worth it in moderation.\ngreat place to get fast food that tastes good. had some solid thai here for lunch last week weekday evening was quiet , not every ta-\npaneer and chicken are both good. i would . ordered the special of the day , a chicken ble was filled. our waiter was amicable and\nprefer to go thursday thru saturday night . curry . quick service and nice interior. only friendly , which is always a plus . the co-\nthats when they have their good shift work- issue was , had a bit of a stomach ache after- conut bread pudding was ok and very sweet\ning . also it stays open late until 4 am on wards ? prefer their sister restaurant, citizen . it ’s definitely a dessert plate that can be\nweekends. really enjoyable! thai and the monkey, in north beach. shared with a glass of wine.\nfor some reason my friend wanted me to ugh ! the salt ! all 5 dishes we ordered were downhill alert ... had a decent lunch at\ngo here with him. it was a decent standard so unbearably salty , i ’d rather just have the dragon well this week marred by pretty\ngreasy slice of pizza. it was n’t bad by any msg . greasy , oily , salty - there is much spotty service. our waiter just did n’t have\nmeans , but it was nothing special at all . better chinese food to be had in sf than here. it together, forgetting to bring bowls for our\non the plus side , cheap and fast . so in i was very disappointed and wo n’t be back. split soup , our beverages , etc. . food was\nsummary : cheap, fast, greasy, average. good but pretty pricey for what we got ."
                    },
                    {
                        "confidence": 0.917290157894737,
                        "content": "ment and price are independent of each other.6 We\ntry to capture this interaction by modeling at the\nsame time review polarity and item price: we con-\nsider the task of jointly predicting aggregate senti-\nment and price for a restaurant.\nFor every restaurant in our dataset, we compute\nits median item price p and its median star rating\nr. The average of these two values for the entire\ndataset ($8.69 and 3.55 stars) split the plane (p, r)\nin four sections: we assign each restaurant to one of\nthese quadrants which we denote 1 e, 1 ®, T e and\nT ®. This allows us to train a 4-class logistic regres-\n6Price and sentiment are both endogenous outcomes reflect-\ning the characteristics of the restaurant. E.g., “better” restau-\nrants can charge higher prices.\nsion model using the REVIEWS feature set for each\nrestaurant. We achieve an accuracy of 65% on the\ntest data, but we are mainly interested in interpret-\ning the estimated feature weights."
                    },
                    {
                        "confidence": 0.9999424,
                        "content": "To visualize the top feature weights learned by the\nmodel, we have to map the four weight vectors\nlearned by the model back to the underlying two-\ndimensional sentiment/price space. Therefore, we\ncompute the following values:"
                    },
                    {
                        "confidence": 0.999990666666667,
                        "content": "We then select for display the features which are the\nfurthest from the origin (max w2 + w*) and rep-\nresent the selected n-grams as points in the senti-\nment/price space to obtain Figure 3.\nWe notice that the spread of the sentiment values\nis larger, which suggests that reviews give stronger\nclues about consumer experience than about the cost\nof a typical meal. However, obvious price-related\nadjectives (inexpensive vs. expensive) appear in this\nlimited selection, as well as certain phrases indicat-\ning both sentiment and price (overpriced vs. very\nreasonable). Other examples of note: gem is used in\nstrongly-positive reviews of cheap restaurants; for\nexpensive restaurants, reviewers use highly recom-\nmended or amazing. Also, phrases like no flavor and\nmanager appear in negative reviews of more expen-\nsive restaurants, while dirty appears more often in\nnegative reviews of cheaper restaurants."
                    },
                    {
                        "confidence": 0.999944636363636,
                        "content": "We have explored linguistic relationships between\nfood prices and customer sentiment through quan-\ntitative analysis of a large corpus of menus and re-\nviews. We have also proposed visualization tech-\nniques to better understand what our models have\nlearned and to see how they can be applied to new\ndata. More broadly, this paper is an example of us-\ning extrinsic variables to drive model-building for\nlinguistic data, and future work might explore richer\nextrinsic variables toward a goal of task-driven no-\ntions of semantics."
                    },
                    {
                        "confidence": 0.929697285714286,
                        "content": "We thank Julie Baron, Ric Crabbe, David Garvett, Laura\nGimpel, Chenxi Jiao, Elaine Lee, members of the ARK\nresearch group, and the anonymous reviewers for helpful\ncomments that improved this paper. This research was\nsupported in part by the NSF through CAREER grant IIS-\n1054319 and Sandia National Laboratories (fellowship to\nK. Gimpel)."
                    }
                ],
                "affiliation": [
                    {
                        "confidence": 0.877408333333333,
                        "content": "Language Technologies Institute\nCarnegie Mellon University\nPittsburgh, PA 15213, USA"
                    },
                    {
                        "confidence": 0.848545,
                        "content": "Tepper School of Business\nCarnegie Mellon University\nPittsburgh, PA 15213, USA"
                    },
                    {
                        "confidence": 0.460066,
                        "content": "Phillips Academy"
                    },
                    {
                        "confidence": 0.939676,
                        "content": "Language Technologies Institute\nCarnegie Mellon University\nPittsburgh, PA 15213, USA"
                    }
                ],
                "sectionHeader": [
                    {
                        "confidence": 0.996617,
                        "genericHeader": "abstract",
                        "content": "Abstract"
                    },
                    {
                        "confidence": 0.998884,
                        "genericHeader": "keywords",
                        "content": "1 Introduction"
                    },
                    {
                        "confidence": 0.999815,
                        "genericHeader": "introduction",
                        "content": "2 Related Work"
                    },
                    {
                        "confidence": 0.995135,
                        "genericHeader": "method",
                        "content": "3 Data"
                    },
                    {
                        "confidence": 0.98104,
                        "genericHeader": "method",
                        "content": "4 Predictive Tasks"
                    },
                    {
                        "confidence": 0.976322,
                        "genericHeader": "method",
                        "content": "5 Menu Item Price Prediction"
                    },
                    {
                        "confidence": 0.9927,
                        "genericHeader": "method",
                        "content": "6 Restaurant Price Range Prediction"
                    },
                    {
                        "confidence": 0.984625,
                        "genericHeader": "method",
                        "content": "7 Joint Prediction of Price and Sentiment"
                    },
                    {
                        "confidence": 0.998906,
                        "genericHeader": "conclusions",
                        "content": "8 Conclusion"
                    },
                    {
                        "confidence": 0.998517,
                        "genericHeader": "acknowledgments",
                        "content": "Acknowledgments"
                    },
                    {
                        "confidence": 0.995194,
                        "genericHeader": "references",
                        "content": "References"
                    }
                ],
                "tableCaption": [
                    {
                        "confidence": 0.999598,
                        "content": "Table 1: Dataset statistics."
                    },
                    {
                        "confidence": 0.80891375,
                        "content": "Table 2: Results for menu item price prediction. MAE =\nmean absolute error ($), MRE = mean relative error (%),\nnf = total number of features, nnz = number of features\nwith non-zero weight."
                    },
                    {
                        "confidence": 0.988015,
                        "content": "Table 3: Selected features from model for menu item\nprice prediction. See text for details."
                    },
                    {
                        "confidence": 0.99340575,
                        "content": "Table 4: Results for restaurant price range prediction.\nMAE = mean absolute error, Acc = classification accu-\nracy (%), nf = total number of features, nnz = number of\nfeatures with non-zero weight."
                    },
                    {
                        "confidence": 0.994634,
                        "content": "Table 5: Reviews from the test set deemed by our model to have particular values of sentiment and price."
                    }
                ],
                "page": [
                    {
                        "confidence": 0.934282,
                        "content": 1357
                    },
                    {
                        "confidence": 0.985507,
                        "content": 1358
                    },
                    {
                        "confidence": 0.987795,
                        "content": 1359
                    },
                    {
                        "confidence": 0.906481,
                        "content": 1360
                    },
                    {
                        "confidence": 0.97689,
                        "content": 1361
                    },
                    {
                        "confidence": 0.971821,
                        "content": 1362
                    },
                    {
                        "confidence": 0.867813,
                        "content": 1363
                    },
                    {
                        "confidence": 0.952756,
                        "content": 1364
                    },
                    {
                        "confidence": 0.97212,
                        "content": 1365
                    },
                    {
                        "confidence": 0.979,
                        "content": 1366
                    },
                    {
                        "confidence": 0.993764,
                        "content": 1367
                    }
                ],
                "figureCaption": [
                    {
                        "confidence": 0.999542,
                        "content": "Figure 1:Frequency distributions of restaurant price"
                    },
                    {
                        "confidence": 0.992212,
                        "content": "Figure 2: Local (position-level) sentiment (brown) and price (yellow) estimates for two sentences in the test corpus."
                    },
                    {
                        "confidence": 0.988006,
                        "content": "Figure 3: Top 50 features from joint prediction of price and sentiment. The black circle is the origin. See text for\ndetails on how the coordinates for each feature were computed. Insets show enlargements of dense areas of the graph."
                    }
                ],
                "email": [
                    {
                        "confidence": 0.998882,
                        "content": "{vchahune,kgimpel}@cs.cmu.edu"
                    },
                    {
                        "confidence": 0.995531,
                        "content": "routledge@cmu.edu"
                    },
                    {
                        "confidence": 0.99216,
                        "content": "lily.scherlis@gmail.com"
                    },
                    {
                        "confidence": 0.995661,
                        "content": "nasmith@cs.cmu.edu"
                    }
                ],
                "table": [
                    {
                        "confidence": 0.9991045,
                        "content": "City # Restaurants # Menu Items test # Reviews test\ntrain dev. test train dev. train dev.\nBoston 930 107 113 63,422 8,426 8,409 80,309 10,976 11,511\nChicago 804 98 100 \u0095\u0096?\u0088\u008b\u008e\u008e \u0084\u008e\u0083 73,251 9,582 10,965\nLos Angeles 624 80 68 51,480 6,633 6,939 \u0091\u0097\u0090\u0096\u0095? 13,227 5,716\nNew York 3,965 473 499 ? ??\u008c\u0091\u008b\u0090\u0092?\u0095\u0096\u0094 75,455 35,529 37,795\nPhiladelphia 1,015 129 117 17,980 2,938 1,592 326,801 7,347 5,790\nSan Francisco 1,908 255 234 ??? 52,275 59,378 67,010\nWashington, D.C. 773 110 121 365,518 42,315 45,728 499,984 11,852 14,129\n??\u008b\u0086? \u0087\u0085\u0096 ? 71,179\n\u0088\u008e ????\n83,818 11,777 9,295\n?\n103,954 12,871 12,510\n47,188 5,957 7,224 ??\u008b\u0086? \u0094 ?\n\u0088 \u0084\u008e\nTotal 10,019 1,252 1,252 733,360 90,917 91,697 1,179,254 147,891 152,916\n\u0088\u0096?\u0095\u008b\u009c\u0087 \u0087\u008f?"
                    },
                    {
                        "confidence": 0.999895272727273,
                        "content": "MAE MRE nf nnz\nPredict mean 3.70 43.32 n/a n/a\nPredict median 3.67 43.93 n/a n/a\nRegression 3.66 45.64 267,945 240,139\nMETADATA 3.55 43.11 268,450 258,828\nPR 3.47 43.11 267,946 205,176\nMENUNAMES 3.23 38.33 896,631 230,840\n+ MENUDESC 3.19 36.23 1,981,787 151,785\n+ PR 3.08 34.51 1,981,788 140,954\n+ METADATA 3.08 34.97 1,982,363 148,774\n+ MENTIONS 3.06 34.37 4,959,488 458,462"
                    },
                    {
                        "confidence": 0.845385816901409,
                        "content": "(a) METADATA: (c) MENUDESC:\nambience descriptors\ndive-y -0.015 old time favorite -0.112\nintimate -0.013 fashioned -0.034\ntrendy -0.012 line caught -0.028\ncasual -0.005 all natural -0.028\nromantic -0.004 traditional -0.009\nclassy -7e-6 natural 3e-4\ntouristy 0.058 classic 0.002\nupscale 0.099 free range 0.004\nreal 0.004\nfresh 0.006\nhomemade 0.010\nauthentic 0.012\norganic 0.020\nspecialty 0.025\nspecial 0.033\nlocally 0.037\nnatural grass fed 0.038\nartisanal 0.064\nraised 0.066\nheirloom 0.083\nwild 0.084\nhormone 0.085\nfarmed 0.099\nhand picked 0.101\nwild caught 0.116\nfarmhouse 0.133\n(b) MENUDESC:\ncooking\npanfried -0.094\nchargrilled -0.029\ncooked -0.012\nboiled -0.006\nfried -0.005\nsteamed 0.011\ncharbroiled 0.015\ngrilled 0.022\nsimmered 0.025\nroasted 0.034\nsauteed 0.034\nbroiled 0.053\nseared 0.066\nbraised 0.068\nstirfried 0.071\nflamebroiled 0.106\n(d) MENUDESC: (e) MENUDESC:\n= “of chicken” = “potatoes”\nslices -0.102 real mashed -0.028\nbits -0.032 mashed -0.005\ncubes -0.030 creamy mashed -5e-9\npieces -0.024 smashed 0.018\nstrips -0.001 smooth mashed 0.129\nchunks 0.015\nmorsels 0.025\npcs 0.040\ncuts 0.042\n(f) MENUDESC:\n= “potato”\nmash -0.022\nmashed -0.019\n(g) MENUDESC: “crisp” vs. “crispy”\ncrisp -0.022 crispy bacon 0.008\ncrispy -0.011 crisp bacon 0.033\n(h) MENUDESC: “roast” vs. “roasted”\nroasted 0.034 roasted potatoes 0.026\nroast 0.040 roast potatoes 0.110\nroasted chicken -0.041 roasted salmon 0.091\nroast chicken -0.012 roast salmon 0.151\nroast pork -0.038 roasted tomato 0.010\nroasted pork 0.055 roast tomato 0.026"
                    },
                    {
                        "confidence": 0.999254833333333,
                        "content": "Features MAE Acc. nf nnz\nPredict mode 0.5421 48.22 n/a n/a\nMENU* 0.3875 66.29 1,910,622 995\nMETADATA 0.2372 77.15 591 219\nREVIEWS 0.2172 79.76 3,027,470 1,567\n+METADATA 0.2111 80.36 3,027,943 1,376"
                    }
                ]
            },
            "version": 110505
        },
        {
            "name": "ParsHed",
            "variant": {
                "no": 0,
                "address": [
                    {
                        "confidence": 0.994966,
                        "content": "Pittsburgh, PA 15213,"
                    },
                    {
                        "confidence": 0.998063,
                        "content": "Pittsburgh, PA 15213, USA"
                    },
                    {
                        "confidence": 0.992438,
                        "content": "Andover, MA 01810,"
                    },
                    {
                        "confidence": 0.997887,
                        "content": "Pittsburgh, PA 15213, USA"
                    }
                ],
                "affiliation": [
                    {
                        "confidence": 0.9656965,
                        "content": "Language Technologies Carnegie Mellon"
                    },
                    {
                        "confidence": 0.9918695,
                        "content": "Tepper School of Business Carnegie Mellon University"
                    },
                    {
                        "confidence": 0.664549,
                        "content": "Phillips"
                    },
                    {
                        "confidence": 0.9991245,
                        "content": "Language Technologies Institute Carnegie Mellon University"
                    }
                ],
                "author": [
                    {
                        "confidence": 0.993095,
                        "content": "Victor Chahuneau Kevin"
                    },
                    {
                        "confidence": 0.997951,
                        "content": "Bryan R Routledge"
                    },
                    {
                        "confidence": 0.847929,
                        "content": "Lily"
                    },
                    {
                        "confidence": 0.999888,
                        "content": "Noah A Smith"
                    }
                ],
                "confidence": 0.390701,
                "abstract": {
                    "confidence": 0.98396375,
                    "content": "We investigate the use of language in food writing, specifically on restaurant menus and in customer reviews. Our approach is to build predictive models of concrete external varisuch as restaurant menu We make use of a dataset of menus and customer reviews for thousands of restaurants in several U.S. cities. By focusing on prediction tasks and doing our analysis at scale, our methodology allows quantitative, objective measurements of the words and phrases used to describe food in restaurants. We also explore interactions in language use between menu and expressed in user reviews."
                },
                "title": {
                    "confidence": 0.999305,
                    "content": "Word Salad: Relating Food Prices and Descriptions"
                },
                "email": [
                    {
                        "confidence": 0.999049,
                        "content": "routledge@cmu.edu"
                    },
                    {
                        "confidence": 0.999865,
                        "content": "lily.scherlis@gmail.com"
                    },
                    {
                        "confidence": 0.999656,
                        "content": "nasmith@cs.cmu.edu"
                    }
                ]
            },
            "version": 110505
        },
        {
            "name": "ParsCit",
            "version": 110505,
            "citationList": {"citation": [
                {
                    "valid": true,
                    "date": 2011,
                    "volume": 57,
                    "rawString": "N. Archak, A. Ghose, and P. G. Ipeirotis. 2011. Deriving the pricing power of product features by mining consumer reviews. Management Science, 57(8).",
                    "journal": "Management Science,",
                    "issue": 8,
                    "marker": "Archak, Ghose, Ipeirotis, 2011",
                    "contexts": {"context": {
                        "startWordPosition": 855,
                        "position": 5486,
                        "citStr": "Archak et al. (2011)",
                        "content": "et al., 2011; Yogatama et al., 2011). Like much of this prior work, we aim to learn how language is used in a specific context while building models that achieve competitive performance on a quantitative prediction task. Along these lines, there is recent interest in exploring the relationship between product sales and user-generated text, particularly online product reviews. For example, Ghose and Ipeirotis (2011) studied the sales impact of particular properties of review text, such as readability, the presence of spelling errors, and the balance between subjective and objective statements. Archak et al. (2011) had a similar goal but decomposed user reviews into parts describing particular aspects of the product being reviewed (Hu and Liu, 2004). Our paper differs from price modeling based on product reviews in several ways. We consider a large set of weaklyrelated products instead of a homogeneous selection of a few products, and the reviews in our dataset are not product-centered but rather describe the overall experience of visiting a restaurant. Consequently, menu items are not always mentioned in reviews and rarely appear with their exact names. This makes it difficult to directly use review fe",
                        "endWordPosition": 858
                    }},
                    "title": "Deriving the pricing power of product features by mining consumer reviews.",
                    "authors": {"author": [
                        "N Archak",
                        "A Ghose",
                        "P G Ipeirotis"
                    ]}
                },
                {
                    "valid": true,
                    "date": 2006,
                    "editor": "In T. Hendershott, editor,",
                    "rawString": "M. R. Baye, J. Morgan, and P. Scholten. 2006. Economics and information systems; handbooks in information systems. In T. Hendershott, editor, Judgement under Uncertainty: Heuristics and Biases. Elsevier, Amsterdam.",
                    "marker": "Baye, Morgan, Scholten, 2006",
                    "publisher": "Elsevier,",
                    "location": "Amsterdam.",
                    "contexts": {"context": {
                        "startWordPosition": 1425,
                        "position": 9013,
                        "citStr": "Baye et al., 2006",
                        "content": "224 ???  ?   Total 10,019 1,252 1,252 733,360 90,917 91,697 1,179,254 147,891 152,916 ? ? Table 1: Dataset statistics.  ? ? ?? ? the word chicken. What is the price of chicken? This ?????? is an important practical and daunting matter when measuring inflation (e.g., Consumer Price Index is measured with a precisely-defined basket of goods). Price dispersion across goods and the variation of the goods is an important area of industrial organization economic theory. For example, economists ?????? ???? are interested in models of search, add-on pricing, and obfuscation (Baye et al., 2006; Ellison, 2005). 3 Data We crawled Allmenus.com (www.allmenus. com) to gather menus for restaurants in seven U.S. cities: Boston, Chicago, Los Angeles, New York, Philadelphia, San Francisco, and Washing??? ton, D.C. Each menu includes a list of item names with optional text descriptions and prices. Most Allmenus restaurant pages contain a link to the corresponding page on Yelp (www.yelp.com) with metadata and user reviews for the restaurant, which we also collected. The metadata consist of many fields for each restaurant, which can be divided into three categories: location (city, neighborhoo",
                        "endWordPosition": 1428
                    }},
                    "title": "Economics and information systems; handbooks in information systems.",
                    "booktitle": "Judgement under Uncertainty: Heuristics and Biases.",
                    "authors": {"author": [
                        "M R Baye",
                        "J Morgan",
                        "P Scholten"
                    ]}
                },
                {
                    "valid": true,
                    "date": 2010,
                    "rawString": "J. Eisenstein, B. O’Connor, N. A. Smith, and E. P. Xing. 2010. A latent variable model for geographic lexical variation. In Proc. of EMNLP.",
                    "marker": "Eisenstein, O’Connor, Smith, Xing, 2010",
                    "title": "A latent variable model for geographic lexical variation.",
                    "booktitle": "In Proc. of EMNLP.",
                    "authors": {"author": [
                        "J Eisenstein",
                        "B O’Connor",
                        "N A Smith",
                        "E P Xing"
                    ]}
                },
                {
                    "valid": true,
                    "date": 2011,
                    "rawString": "J. Eisenstein, N. A. Smith, and E. P. Xing. 2011. Discovering sociolinguistic associations with structured sparsity. In Proc. of ACL.",
                    "marker": "Eisenstein, Smith, Xing, 2011",
                    "contexts": {"context": {
                        "startWordPosition": 762,
                        "position": 4878,
                        "citStr": "Eisenstein et al., 2011",
                        "content": "d. In particular, they showed that price affects how “authenticity” is realized in marketing language, a point we return to in §5. This is an example of how price can affect how an underlying variable is expressed in language. Among other explorations in this paper, we consider how price interacts with expression of sentiment in user reviews of restaurants. As mentioned above, our work is related to research in predicting real-world quantities using text data (Koppel and Shtrimberg, 2006; Ghose et al., 2007; Lerman et al., 2008; Kogan et al., 2009; Joshi et al., 2010; Eisenstein et al., 2010; Eisenstein et al., 2011; Yogatama et al., 2011). Like much of this prior work, we aim to learn how language is used in a specific context while building models that achieve competitive performance on a quantitative prediction task. Along these lines, there is recent interest in exploring the relationship between product sales and user-generated text, particularly online product reviews. For example, Ghose and Ipeirotis (2011) studied the sales impact of particular properties of review text, such as readability, the presence of spelling errors, and the balance between subjective and objective statements. Archak et al",
                        "endWordPosition": 765
                    }},
                    "title": "Discovering sociolinguistic associations with structured sparsity.",
                    "booktitle": "In Proc. of ACL.",
                    "authors": {"author": [
                        "J Eisenstein",
                        "N A Smith",
                        "E P Xing"
                    ]}
                },
                {
                    "valid": true,
                    "date": 2005,
                    "volume": 120,
                    "rawString": "G. Ellison. 2005. A model of add-on pricing. Quarterly Journal of Economics, 120(2):585–637, May.",
                    "journal": "Quarterly Journal of Economics,",
                    "issue": 2,
                    "marker": "Ellison, 2005",
                    "contexts": {"context": {
                        "startWordPosition": 1429,
                        "position": 9029,
                        "citStr": "Ellison, 2005",
                        "content": "Total 10,019 1,252 1,252 733,360 90,917 91,697 1,179,254 147,891 152,916 ? ? Table 1: Dataset statistics.  ? ? ?? ? the word chicken. What is the price of chicken? This ?????? is an important practical and daunting matter when measuring inflation (e.g., Consumer Price Index is measured with a precisely-defined basket of goods). Price dispersion across goods and the variation of the goods is an important area of industrial organization economic theory. For example, economists ?????? ???? are interested in models of search, add-on pricing, and obfuscation (Baye et al., 2006; Ellison, 2005). 3 Data We crawled Allmenus.com (www.allmenus. com) to gather menus for restaurants in seven U.S. cities: Boston, Chicago, Los Angeles, New York, Philadelphia, San Francisco, and Washing??? ton, D.C. Each menu includes a list of item names with optional text descriptions and prices. Most Allmenus restaurant pages contain a link to the corresponding page on Yelp (www.yelp.com) with metadata and user reviews for the restaurant, which we also collected. The metadata consist of many fields for each restaurant, which can be divided into three categories: location (city, neighborhood, transit stop)",
                        "endWordPosition": 1430
                    }},
                    "title": "A model of add-on pricing.",
                    "authors": {"author": "G Ellison"}
                },
                {
                    "valid": true,
                    "date": 2011,
                    "volume": 11,
                    "rawString": "J. Freedman and D. Jurafsky. 2011. Authenticity in America: Class distinctions in potato chip advertising. Gastronomica, 11(4):46–54.",
                    "journal": "Gastronomica,",
                    "issue": 4,
                    "marker": "Freedman, Jurafsky, 2011",
                    "contexts": {"context": [
                        {
                            "startWordPosition": 595,
                            "position": 3877,
                            "citStr": "Freedman and Jurafsky (2011)",
                            "content": "357–1367, Jeju Island, Korea, 12–14 July 2012. c?2012 Association for Computational Linguistics analysis of language used to describe food (by its purveyors and by its consumers). While our primary goal is to understand the language used in our corpus, our findings bear relevance to economics and hospitality research as well. This paper is a step on the way to the eventual goal of using linguistic analysis to understand social phenomena like sales and consumption. 2 Related Work There are several areas of related work scattered throughout linguistics, NLP, hospitality research, and economics. Freedman and Jurafsky (2011) studied the use of language in food advertising, specifically the words on potato chip bags. They argued that, due to the ubiquity of food writing across cultures, ethnic groups, and social classes, studying the use of language for describing food can provide perspective on how different socioeconomic groups selfidentify using language and how they are linguistically targeted. In particular, they showed that price affects how “authenticity” is realized in marketing language, a point we return to in §5. This is an example of how price can affect how an underlying variable is expressed in langu",
                            "endWordPosition": 598
                        },
                        {
                            "startWordPosition": 3205,
                            "position": 19617,
                            "citStr": "Freedman and Jurafsky (2011)",
                            "content": "ed into several categories (taken from the model with MENUNAMES + MENUDESC + PR + METADATA). Table 3(a) shows selected features for the “ambience” field in the Yelp restaurant metadata and pane (b) lists some unigrams related to cooking methods. Pane (c) shows feature weights for ngrams often used to market menu items; we see larger weights for words targeting those who want to eat organically- or locally-grown food (farmhouse, heirloom, wild, and hormone), compared to those looking for comfort food (old time favorite, traditional, real, and fashioned). This is related to observations made by Freedman and Jurafsky (2011) that cheaper food is marketed by appealing to tradition and historicity, with more expensive food described in terms of naturalness, quality of ingredients, and the preparation process (e.g., handpicked, wild caught, etc.). Relatedly, in pane (e) we see that real mashed potatoes are expected to be cheaper than those described as creamy or smooth. Pane (d) shows feature weights for trigrams containing units of chicken; we can see an ordering in terms of size (bits < cubes < strips < cuts) as well as the price increase associated with the use of the word morsels in place of less refined units.",
                            "endWordPosition": 3208
                        }
                    ]},
                    "title": "Authenticity in America: Class distinctions in potato chip advertising.",
                    "authors": {"author": [
                        "J Freedman",
                        "D Jurafsky"
                    ]}
                },
                {
                    "valid": true,
                    "date": 2011,
                    "volume": 23,
                    "rawString": "A. Ghose and P. G. Ipeirotis. 2011. Estimating the helpfulness and economic impact of product reviews: Mining text and reviewer characteristics. IEEE Transactions on Knowledge and Data Engineering, 23(10).",
                    "journal": "IEEE Transactions on Knowledge and Data Engineering,",
                    "issue": 10,
                    "marker": "Ghose, Ipeirotis, 2011",
                    "contexts": {"context": {
                        "startWordPosition": 825,
                        "position": 5284,
                        "citStr": "Ghose and Ipeirotis (2011)",
                        "content": "research in predicting real-world quantities using text data (Koppel and Shtrimberg, 2006; Ghose et al., 2007; Lerman et al., 2008; Kogan et al., 2009; Joshi et al., 2010; Eisenstein et al., 2010; Eisenstein et al., 2011; Yogatama et al., 2011). Like much of this prior work, we aim to learn how language is used in a specific context while building models that achieve competitive performance on a quantitative prediction task. Along these lines, there is recent interest in exploring the relationship between product sales and user-generated text, particularly online product reviews. For example, Ghose and Ipeirotis (2011) studied the sales impact of particular properties of review text, such as readability, the presence of spelling errors, and the balance between subjective and objective statements. Archak et al. (2011) had a similar goal but decomposed user reviews into parts describing particular aspects of the product being reviewed (Hu and Liu, 2004). Our paper differs from price modeling based on product reviews in several ways. We consider a large set of weaklyrelated products instead of a homogeneous selection of a few products, and the reviews in our dataset are not product-centered but rather describe",
                        "endWordPosition": 828
                    }},
                    "title": "Estimating the helpfulness and economic impact of product reviews: Mining text and reviewer characteristics.",
                    "authors": {"author": [
                        "A Ghose",
                        "P G Ipeirotis"
                    ]}
                },
                {
                    "valid": true,
                    "date": 2007,
                    "rawString": "A. Ghose, P. G. Ipeirotis, and A. Sundararajan. 2007. Opinion mining using econometrics: A case study on reputation systems. In Proc. of ACL.",
                    "marker": "Ghose, Ipeirotis, Sundararajan, 2007",
                    "contexts": {"context": {
                        "startWordPosition": 742,
                        "position": 4767,
                        "citStr": "Ghose et al., 2007",
                        "content": "on how different socioeconomic groups selfidentify using language and how they are linguistically targeted. In particular, they showed that price affects how “authenticity” is realized in marketing language, a point we return to in §5. This is an example of how price can affect how an underlying variable is expressed in language. Among other explorations in this paper, we consider how price interacts with expression of sentiment in user reviews of restaurants. As mentioned above, our work is related to research in predicting real-world quantities using text data (Koppel and Shtrimberg, 2006; Ghose et al., 2007; Lerman et al., 2008; Kogan et al., 2009; Joshi et al., 2010; Eisenstein et al., 2010; Eisenstein et al., 2011; Yogatama et al., 2011). Like much of this prior work, we aim to learn how language is used in a specific context while building models that achieve competitive performance on a quantitative prediction task. Along these lines, there is recent interest in exploring the relationship between product sales and user-generated text, particularly online product reviews. For example, Ghose and Ipeirotis (2011) studied the sales impact of particular properties of review text, such as readabil",
                        "endWordPosition": 745
                    }},
                    "title": "Opinion mining using econometrics: A case study on reputation systems.",
                    "booktitle": "In Proc. of ACL.",
                    "authors": {"author": [
                        "A Ghose",
                        "P G Ipeirotis",
                        "A Sundararajan"
                    ]}
                },
                {
                    "valid": true,
                    "date": 2004,
                    "rawString": "M. Hu and B. Liu. 2004. Mining opinion features in customer reviews. In Proc. of AAAI.",
                    "marker": "Hu, Liu, 2004",
                    "contexts": {"context": {
                        "startWordPosition": 877,
                        "position": 5623,
                        "citStr": "Hu and Liu, 2004",
                        "content": "g models that achieve competitive performance on a quantitative prediction task. Along these lines, there is recent interest in exploring the relationship between product sales and user-generated text, particularly online product reviews. For example, Ghose and Ipeirotis (2011) studied the sales impact of particular properties of review text, such as readability, the presence of spelling errors, and the balance between subjective and objective statements. Archak et al. (2011) had a similar goal but decomposed user reviews into parts describing particular aspects of the product being reviewed (Hu and Liu, 2004). Our paper differs from price modeling based on product reviews in several ways. We consider a large set of weaklyrelated products instead of a homogeneous selection of a few products, and the reviews in our dataset are not product-centered but rather describe the overall experience of visiting a restaurant. Consequently, menu items are not always mentioned in reviews and rarely appear with their exact names. This makes it difficult to directly use review features in a pricing model for individual menu items. Menu planning and pricing has been studied for many years by the culinary and hospit",
                        "endWordPosition": 880
                    }},
                    "title": "Mining opinion features in customer reviews.",
                    "booktitle": "In Proc. of AAAI.",
                    "authors": {"author": [
                        "M Hu",
                        "B Liu"
                    ]}
                },
                {
                    "valid": true,
                    "date": 2010,
                    "rawString": "M. Joshi, D. Das, K. Gimpel, and N. A. Smith. 2010. Movie reviews and revenues: An experiment in text regression. In Proc. of NAACL.",
                    "marker": "Joshi, Das, Gimpel, Smith, 2010",
                    "contexts": {"context": [
                        {
                            "startWordPosition": 290,
                            "position": 1930,
                            "citStr": "Joshi et al., 2010",
                            "content": "ustomer writes an unfavorable review of a restaurant, how is her word choice affected by the restaurant’s prices? In this paper, we explore questions like these that relate restaurant menus, prices, and customer sentiment. Our goal is to understand how language is used in the food domain, and we direct our investigation using external variables such as restaurant menu prices. We build on a thread of NLP research that seeks linguistic understanding by predicting real-world quantities from text data. Recent examples include prediction of stock volatility (Kogan et al., 2009) and movie revenues (Joshi et al., 2010). There, prediction tasks were used for quantitative evaluation and objective model comparison, while analysis of learned models gave insight about the social process behind the data. We echo this pattern here as we turn our attention to language use on restaurant menus and in user restaurant reviews. We use data from a large corpus of restaurant menus and reviews crawled from the web and formulate several prediction tasks. In addition to predicting menu prices, we also consider predicting sentiment along with price. The relationship between language and sentiment is an active area of investig",
                            "endWordPosition": 293
                        },
                        {
                            "startWordPosition": 754,
                            "position": 4828,
                            "citStr": "Joshi et al., 2010",
                            "content": "guage and how they are linguistically targeted. In particular, they showed that price affects how “authenticity” is realized in marketing language, a point we return to in §5. This is an example of how price can affect how an underlying variable is expressed in language. Among other explorations in this paper, we consider how price interacts with expression of sentiment in user reviews of restaurants. As mentioned above, our work is related to research in predicting real-world quantities using text data (Koppel and Shtrimberg, 2006; Ghose et al., 2007; Lerman et al., 2008; Kogan et al., 2009; Joshi et al., 2010; Eisenstein et al., 2010; Eisenstein et al., 2011; Yogatama et al., 2011). Like much of this prior work, we aim to learn how language is used in a specific context while building models that achieve competitive performance on a quantitative prediction task. Along these lines, there is recent interest in exploring the relationship between product sales and user-generated text, particularly online product reviews. For example, Ghose and Ipeirotis (2011) studied the sales impact of particular properties of review text, such as readability, the presence of spelling errors, and the balance between",
                            "endWordPosition": 757
                        }
                    ]},
                    "title": "Movie reviews and revenues: An experiment in text regression.",
                    "booktitle": "In Proc. of NAACL.",
                    "authors": {"author": [
                        "M Joshi",
                        "D Das",
                        "K Gimpel",
                        "N A Smith"
                    ]}
                },
                {
                    "valid": true,
                    "date": 1982,
                    "rawString": "M. L. Kasavana and D. I. Smith. 1982. Menu Engineering: A Practical Guide to Menu Analysis. Hospitality Publications.",
                    "marker": "Kasavana, Smith, 1982",
                    "publisher": "Hospitality Publications.",
                    "contexts": {"context": {
                        "startWordPosition": 981,
                        "position": 6273,
                        "citStr": "Kasavana and Smith, 1982",
                        "content": "rice modeling based on product reviews in several ways. We consider a large set of weaklyrelated products instead of a homogeneous selection of a few products, and the reviews in our dataset are not product-centered but rather describe the overall experience of visiting a restaurant. Consequently, menu items are not always mentioned in reviews and rarely appear with their exact names. This makes it difficult to directly use review features in a pricing model for individual menu items. Menu planning and pricing has been studied for many years by the culinary and hospitality research community (Kasavana and Smith, 1982; Kelly et al., 1994), often including recommendations for writing menu item descriptions (Miller and Pavesic, 1996; McVety et al., 2008). Their guidelines frequently include example menus from successful restaurants, but typically do not use large corpora of menus or automated analysis, as we do here. Other work focused more specifically on particular aspects of the language used on menus, such as the study by Zwicky and Zwicky (1980), who made linguistic observations through manual analysis of a corpus of 200 menus. Relatedly, Wansink et al. (2001; 2005) showed that the way that menu items a",
                        "endWordPosition": 984
                    }},
                    "title": "Menu Engineering: A Practical Guide to Menu Analysis.",
                    "authors": {"author": [
                        "M L Kasavana",
                        "D I Smith"
                    ]}
                },
                {
                    "valid": true,
                    "date": 1994,
                    "volume": 35,
                    "rawString": "T. J. Kelly, N. M. Kiefer, and K. Burdett. 1994. A demand-based approach to menu pricing. Cornell Hotel and Restaurant Administrative Quarterly, 35(1).",
                    "issue": 1,
                    "marker": "Kelly, Kiefer, Burdett, 1994",
                    "contexts": {"context": {
                        "startWordPosition": 985,
                        "position": 6294,
                        "citStr": "Kelly et al., 1994",
                        "content": "duct reviews in several ways. We consider a large set of weaklyrelated products instead of a homogeneous selection of a few products, and the reviews in our dataset are not product-centered but rather describe the overall experience of visiting a restaurant. Consequently, menu items are not always mentioned in reviews and rarely appear with their exact names. This makes it difficult to directly use review features in a pricing model for individual menu items. Menu planning and pricing has been studied for many years by the culinary and hospitality research community (Kasavana and Smith, 1982; Kelly et al., 1994), often including recommendations for writing menu item descriptions (Miller and Pavesic, 1996; McVety et al., 2008). Their guidelines frequently include example menus from successful restaurants, but typically do not use large corpora of menus or automated analysis, as we do here. Other work focused more specifically on particular aspects of the language used on menus, such as the study by Zwicky and Zwicky (1980), who made linguistic observations through manual analysis of a corpus of 200 menus. Relatedly, Wansink et al. (2001; 2005) showed that the way that menu items are described affects",
                        "endWordPosition": 988
                    }},
                    "title": "A demand-based approach to menu pricing. Cornell Hotel and Restaurant Administrative Quarterly,",
                    "authors": {"author": [
                        "T J Kelly",
                        "N M Kiefer",
                        "K Burdett"
                    ]}
                },
                {
                    "valid": true,
                    "date": 2009,
                    "rawString": "S. Kogan, D. Levin, B. R. Routledge, J. Sagi, and N. A. Smith. 2009. Predicting risk from financial reports with regression. In Proc. of NAACL.",
                    "marker": "Kogan, Levin, Routledge, Sagi, Smith, 2009",
                    "contexts": {"context": [
                        {
                            "startWordPosition": 283,
                            "position": 1890,
                            "citStr": "Kogan et al., 2009",
                            "content": ". charbroiled affect its price? When a customer writes an unfavorable review of a restaurant, how is her word choice affected by the restaurant’s prices? In this paper, we explore questions like these that relate restaurant menus, prices, and customer sentiment. Our goal is to understand how language is used in the food domain, and we direct our investigation using external variables such as restaurant menu prices. We build on a thread of NLP research that seeks linguistic understanding by predicting real-world quantities from text data. Recent examples include prediction of stock volatility (Kogan et al., 2009) and movie revenues (Joshi et al., 2010). There, prediction tasks were used for quantitative evaluation and objective model comparison, while analysis of learned models gave insight about the social process behind the data. We echo this pattern here as we turn our attention to language use on restaurant menus and in user restaurant reviews. We use data from a large corpus of restaurant menus and reviews crawled from the web and formulate several prediction tasks. In addition to predicting menu prices, we also consider predicting sentiment along with price. The relationship between language and",
                            "endWordPosition": 286
                        },
                        {
                            "startWordPosition": 750,
                            "position": 4808,
                            "citStr": "Kogan et al., 2009",
                            "content": "lfidentify using language and how they are linguistically targeted. In particular, they showed that price affects how “authenticity” is realized in marketing language, a point we return to in §5. This is an example of how price can affect how an underlying variable is expressed in language. Among other explorations in this paper, we consider how price interacts with expression of sentiment in user reviews of restaurants. As mentioned above, our work is related to research in predicting real-world quantities using text data (Koppel and Shtrimberg, 2006; Ghose et al., 2007; Lerman et al., 2008; Kogan et al., 2009; Joshi et al., 2010; Eisenstein et al., 2010; Eisenstein et al., 2011; Yogatama et al., 2011). Like much of this prior work, we aim to learn how language is used in a specific context while building models that achieve competitive performance on a quantitative prediction task. Along these lines, there is recent interest in exploring the relationship between product sales and user-generated text, particularly online product reviews. For example, Ghose and Ipeirotis (2011) studied the sales impact of particular properties of review text, such as readability, the presence of spelling errors, and",
                            "endWordPosition": 753
                        }
                    ]},
                    "title": "Predicting risk from financial reports with regression.",
                    "booktitle": "In Proc. of NAACL.",
                    "authors": {"author": [
                        "S Kogan",
                        "D Levin",
                        "B R Routledge",
                        "J Sagi",
                        "N A Smith"
                    ]}
                },
                {
                    "valid": true,
                    "date": 2006,
                    "rawString": "M. Koppel and I. Shtrimberg. 2006. Good news or bad news? let the market decide. Computing Attitude and Affect in Text: Theory and Applications.",
                    "marker": "Koppel, Shtrimberg, 2006",
                    "contexts": {"context": {
                        "startWordPosition": 738,
                        "position": 4747,
                        "citStr": "Koppel and Shtrimberg, 2006",
                        "content": "food can provide perspective on how different socioeconomic groups selfidentify using language and how they are linguistically targeted. In particular, they showed that price affects how “authenticity” is realized in marketing language, a point we return to in §5. This is an example of how price can affect how an underlying variable is expressed in language. Among other explorations in this paper, we consider how price interacts with expression of sentiment in user reviews of restaurants. As mentioned above, our work is related to research in predicting real-world quantities using text data (Koppel and Shtrimberg, 2006; Ghose et al., 2007; Lerman et al., 2008; Kogan et al., 2009; Joshi et al., 2010; Eisenstein et al., 2010; Eisenstein et al., 2011; Yogatama et al., 2011). Like much of this prior work, we aim to learn how language is used in a specific context while building models that achieve competitive performance on a quantitative prediction task. Along these lines, there is recent interest in exploring the relationship between product sales and user-generated text, particularly online product reviews. For example, Ghose and Ipeirotis (2011) studied the sales impact of particular properties of review te",
                        "endWordPosition": 741
                    }},
                    "title": "Good news or bad news? let the market decide. Computing Attitude and Affect in Text: Theory and Applications.",
                    "authors": {"author": [
                        "M Koppel",
                        "I Shtrimberg"
                    ]}
                },
                {
                    "valid": true,
                    "date": 2008,
                    "rawString": "K. Lerman, A. Gilder, M. Dredze, and F. Pereira. 2008. Reading the markets: Forecasting public opinion of political candidates by news analysis. In Proc. of COLING.",
                    "marker": "Lerman, Gilder, Dredze, Pereira, 2008",
                    "contexts": {"context": {
                        "startWordPosition": 746,
                        "position": 4788,
                        "citStr": "Lerman et al., 2008",
                        "content": "cioeconomic groups selfidentify using language and how they are linguistically targeted. In particular, they showed that price affects how “authenticity” is realized in marketing language, a point we return to in §5. This is an example of how price can affect how an underlying variable is expressed in language. Among other explorations in this paper, we consider how price interacts with expression of sentiment in user reviews of restaurants. As mentioned above, our work is related to research in predicting real-world quantities using text data (Koppel and Shtrimberg, 2006; Ghose et al., 2007; Lerman et al., 2008; Kogan et al., 2009; Joshi et al., 2010; Eisenstein et al., 2010; Eisenstein et al., 2011; Yogatama et al., 2011). Like much of this prior work, we aim to learn how language is used in a specific context while building models that achieve competitive performance on a quantitative prediction task. Along these lines, there is recent interest in exploring the relationship between product sales and user-generated text, particularly online product reviews. For example, Ghose and Ipeirotis (2011) studied the sales impact of particular properties of review text, such as readability, the presence of",
                        "endWordPosition": 749
                    }},
                    "title": "Reading the markets: Forecasting public opinion of political candidates by news analysis.",
                    "booktitle": "In Proc. of COLING.",
                    "authors": {"author": [
                        "K Lerman",
                        "A Gilder",
                        "M Dredze",
                        "F Pereira"
                    ]}
                },
                {
                    "valid": true,
                    "date": 1980,
                    "rawString": "P. McCullagh. 1980. Regression models for ordinal data. Journal of the royal statistical society. Series B (Methodological), pages 109–142.",
                    "journal": "Journal of the royal statistical society. Series B (Methodological),",
                    "pages": "109--142",
                    "marker": "McCullagh, 1980",
                    "contexts": {"context": {
                        "startWordPosition": 3821,
                        "position": 23474,
                        "citStr": "McCullagh, 1980",
                        "content": "cting the price range listed for each restaurant on its Yelp page. The values for this field are integers from 1 to 4 and indicate the price of a typical meal from the restaurant. For this task, we again train an `1-regularized linear regression model with integral price ranges as the true output values yi. Each input xi corresponds to the feature vector for an entire restaurant. For evaluation, we round the predicted values to the nearest integer: yi = ROUND(wTxi) and report the corresponding mean absolute error and accuracy. We compared this simple approach with an ordinal regression model (McCullagh, 1980) trained with the same il regularizer and noted very little improvement (77.32% vs. 77.15% accuracy for METADATA). Therefore, we only report in this section results for the linear regression model. In addition to the feature sets used for individual menu item price prediction, we used features on reviews (REVIEWS). Specifically, we used binary features for unigrams, bigrams, and trigrams in the full set of reviews for each restaurant. A stopword list was derived from the training data.4 Bigrams and trigrams were filtered if they ended with stopwords. Additionally, features occurring fewer than",
                        "endWordPosition": 3822
                    }},
                    "title": "Regression models for ordinal data.",
                    "authors": {"author": "P McCullagh"}
                },
                {
                    "valid": true,
                    "date": 2008,
                    "rawString": "P. J. McVety, B. J. Ware, and C. L. Ware. 2008. Fundamentals of Menu Planning. John Wiley & Sons.",
                    "marker": "McVety, Ware, Ware, 2008",
                    "publisher": "John Wiley & Sons.",
                    "contexts": {"context": {
                        "startWordPosition": 1001,
                        "position": 6410,
                        "citStr": "McVety et al., 2008",
                        "content": "of a few products, and the reviews in our dataset are not product-centered but rather describe the overall experience of visiting a restaurant. Consequently, menu items are not always mentioned in reviews and rarely appear with their exact names. This makes it difficult to directly use review features in a pricing model for individual menu items. Menu planning and pricing has been studied for many years by the culinary and hospitality research community (Kasavana and Smith, 1982; Kelly et al., 1994), often including recommendations for writing menu item descriptions (Miller and Pavesic, 1996; McVety et al., 2008). Their guidelines frequently include example menus from successful restaurants, but typically do not use large corpora of menus or automated analysis, as we do here. Other work focused more specifically on particular aspects of the language used on menus, such as the study by Zwicky and Zwicky (1980), who made linguistic observations through manual analysis of a corpus of 200 menus. Relatedly, Wansink et al. (2001; 2005) showed that the way that menu items are described affects customers’ perceptions and purchasing behavior. When menu items are described evocatively, customers choose them mor",
                        "endWordPosition": 1004
                    }},
                    "title": "Fundamentals of Menu Planning.",
                    "authors": {"author": [
                        "P J McVety",
                        "B J Ware",
                        "C L Ware"
                    ]}
                },
                {
                    "valid": true,
                    "date": 1996,
                    "rawString": "J. E. Miller and D. V. Pavesic. 1996. Menu: Pricing & Strategy. Hospitality, Travel, and Tourism Series. John Wiley & Sons.",
                    "marker": "Miller, Pavesic, 1996",
                    "publisher": "John Wiley & Sons.",
                    "contexts": {"context": {
                        "startWordPosition": 997,
                        "position": 6388,
                        "citStr": "Miller and Pavesic, 1996",
                        "content": "f a homogeneous selection of a few products, and the reviews in our dataset are not product-centered but rather describe the overall experience of visiting a restaurant. Consequently, menu items are not always mentioned in reviews and rarely appear with their exact names. This makes it difficult to directly use review features in a pricing model for individual menu items. Menu planning and pricing has been studied for many years by the culinary and hospitality research community (Kasavana and Smith, 1982; Kelly et al., 1994), often including recommendations for writing menu item descriptions (Miller and Pavesic, 1996; McVety et al., 2008). Their guidelines frequently include example menus from successful restaurants, but typically do not use large corpora of menus or automated analysis, as we do here. Other work focused more specifically on particular aspects of the language used on menus, such as the study by Zwicky and Zwicky (1980), who made linguistic observations through manual analysis of a corpus of 200 menus. Relatedly, Wansink et al. (2001; 2005) showed that the way that menu items are described affects customers’ perceptions and purchasing behavior. When menu items are described evocatively, cus",
                        "endWordPosition": 1000
                    }},
                    "title": "Menu: Pricing & Strategy. Hospitality, Travel, and Tourism Series.",
                    "authors": {"author": [
                        "J E Miller",
                        "D V Pavesic"
                    ]}
                },
                {
                    "valid": true,
                    "date": 2008,
                    "rawString": "B. Pang and L. Lee. 2008. Opinion mining and sentiment analysis. Foundations and Trends in Information Retrieval, 2(1-2):1–135.",
                    "pages": "2--1",
                    "marker": "Pang, Lee, 2008",
                    "contexts": {"context": [
                        {
                            "startWordPosition": 392,
                            "position": 2556,
                            "citStr": "Pang and Lee, 2008",
                            "content": ", prediction tasks were used for quantitative evaluation and objective model comparison, while analysis of learned models gave insight about the social process behind the data. We echo this pattern here as we turn our attention to language use on restaurant menus and in user restaurant reviews. We use data from a large corpus of restaurant menus and reviews crawled from the web and formulate several prediction tasks. In addition to predicting menu prices, we also consider predicting sentiment along with price. The relationship between language and sentiment is an active area of investigation (Pang and Lee, 2008). Much of this research has focused on customer-written reviews of goods and services, and perspectives have been gained on how sentiment is expressed in this type of informal text. In addition to sentiment, however, other variables are reflected in a reviewer’s choice of words, such as the price of the item under consideration. In this paper, we take a step toward joint modeling of multiple variables in review text, exploring connections between price and sentiment in restaurant reviews. Hence this paper contributes an exploratory data 1357 Proceedings of the 2012 Joint Conference on Empirica",
                            "endWordPosition": 395
                        },
                        {
                            "startWordPosition": 4208,
                            "position": 25830,
                            "citStr": "Pang and Lee, 2008",
                            "content": "eview text. To do this, we trained a logistic regression model predicting polarity for each review; we used the REVIEWS feature set, but this time considering each review as a single training instance. The polarity of a review was determined by whether or not its star rating was greater than the average rating across all reviews in the dataset (3.7 stars). We achieved an accuracy of 87% on the test data. We omit full details of these models because the polarity prediction task for user reviews is wellknown in the sentiment analysis community and our model is not an innovation over prior work (Pang and Lee, 2008). However, our purpose in training the model was to use the learned weights for understanding the text in the reviews. 6.2 Interpreting Reviews Given learned models for predicting a restaurant’s price range from its set of reviews as well as polarity for each review, we can turn the process around and use the feature weights to analyze the review text. Restricting our attention to reviews of 50–60 words, Table 5 shows sample reviews from our test set that lead to various predictions of price range and sentiment.5 This technique can also be useful when trying to determine the “true” star rating",
                            "endWordPosition": 4211
                        }
                    ]},
                    "title": "Opinion mining and sentiment analysis.",
                    "booktitle": "Foundations and Trends in Information Retrieval,",
                    "authors": {"author": [
                        "B Pang",
                        "L Lee"
                    ]}
                },
                {
                    "valid": true,
                    "date": 2001,
                    "volume": 42,
                    "rawString": "B. Wansink, J. E. Painter, and K. van Ittersum. 2001. Descriptive menu labels’ effect on sales. Cornell Hotel and Restaurant Administrative Quarterly, 42(6).",
                    "issue": 6,
                    "marker": "Wansink, Painter, van Ittersum, 2001",
                    "title": "Descriptive menu labels’ effect on sales. Cornell Hotel and Restaurant Administrative Quarterly,",
                    "authors": {"author": [
                        "B Wansink",
                        "J E Painter",
                        "K van Ittersum"
                    ]}
                },
                {
                    "valid": true,
                    "date": 2005,
                    "volume": 16,
                    "rawString": "B. Wansink, K. van Ittersum, and J. E. Painter. 2005. How descriptive food names bias sensory perceptions in restaurants. Food Quality and Preference, 16(5).",
                    "issue": 5,
                    "marker": "Wansink, van Ittersum, Painter, 2005",
                    "title": "How descriptive food names bias sensory perceptions in restaurants. Food Quality and Preference,",
                    "authors": {"author": [
                        "B Wansink",
                        "K van Ittersum",
                        "J E Painter"
                    ]}
                },
                {
                    "valid": true,
                    "date": 2011,
                    "rawString": "D. Yogatama, M. Heilman, B. O’Connor, C. Dyer, B. R. Routledge, and N. A. Smith. 2011. Predicting a scientific community’s response to an article. In Proc. of EMNLP.",
                    "marker": "Yogatama, Heilman, O’Connor, Dyer, Routledge, Smith, 2011",
                    "title": "Predicting a scientific community’s response to an article.",
                    "booktitle": "In Proc. of EMNLP.",
                    "authors": {"author": [
                        "D Yogatama",
                        "M Heilman",
                        "B O’Connor",
                        "C Dyer",
                        "B R Routledge",
                        "N A Smith"
                    ]}
                },
                {
                    "valid": true,
                    "date": 1980,
                    "volume": 55,
                    "rawString": "A. D. Zwicky and A. M. Zwicky. 1980. America’s national dish: The style of restaurant menus. American Speech, 55(2):83–92.",
                    "journal": "American Speech,",
                    "issue": 2,
                    "marker": "Zwicky, Zwicky, 1980",
                    "contexts": {"context": {
                        "startWordPosition": 1049,
                        "position": 6712,
                        "citStr": "Zwicky and Zwicky (1980)",
                        "content": "ures in a pricing model for individual menu items. Menu planning and pricing has been studied for many years by the culinary and hospitality research community (Kasavana and Smith, 1982; Kelly et al., 1994), often including recommendations for writing menu item descriptions (Miller and Pavesic, 1996; McVety et al., 2008). Their guidelines frequently include example menus from successful restaurants, but typically do not use large corpora of menus or automated analysis, as we do here. Other work focused more specifically on particular aspects of the language used on menus, such as the study by Zwicky and Zwicky (1980), who made linguistic observations through manual analysis of a corpus of 200 menus. Relatedly, Wansink et al. (2001; 2005) showed that the way that menu items are described affects customers’ perceptions and purchasing behavior. When menu items are described evocatively, customers choose them more often and report higher satisfaction with quality and value, as compared to when they are given the same items described with conventional names. Wansink et al. did not use a corpus, but rather conducted a small-scale experiment in a working cafeteria with customers and collected surveys to analyze",
                        "endWordPosition": 1052
                    }},
                    "title": "America’s national dish: The style of restaurant menus.",
                    "authors": {"author": [
                        "A D Zwicky",
                        "A M Zwicky"
                    ]}
                }
            ]}
        }
    ]
}}